{
    "artciles": [
        {
            "q" : " What does ALU stand for? ",
            "opt1" : "Arithmetic logic unit ",
            "opt2" : "Arithmetic language unit ",
            "opt3" : "Arithmetic logic unicode ",
            "answer" : "Arithmetic logic unit",
            "decription" :"ALU Stands for Arithmetic logic unit."
        },
        {
            "q" : " Number of bits in ALU is _________",
            "opt1" : " 4",
            "opt2" : " 8",
            "opt3" : "16",
            "answer" : "16",
            "description" :"Data Selector is another name of Multiplexer. A multiplexer (or MUX) is a device that selects one of several analog or digital input signals and forwards the selected input into a single line, depending on the active select lines."
        },
        {
            "q" : "The flag bits in an ALU is defined as ___________",
            "opt1" : " The total number of registers  ",
            "opt2" : "The status bit conditions",
            "opt3" : "The total number of control lines",
            "answer" : "The status bit conditions",
            "description" :"In an ALU, status bit conditions are sometimes called condition code bits or flag bits. It is so called because they tend to represent the status of the respect flags after any operation. "
        },
        {
            "q" : "Which is the major functioning responsibility of the multiplexing combinational circuit?",
            "opt1" : "Decoding the binary information",
            "opt2" : "Generation of all minterms in an output function with OR-gate",
            "opt3" : "Generation of selected path between multiple sources and a single destination",
            "answer" : "Generation of selected path between multiple sources and a single destination",
            "description":"The major functioning responsibility of the multiplexing combinational circuit is generation of selected path between multiple sources and a single destination because it makes the circuit too flexible."
        },
        {
            "q" : " The design of an ALU is based on __________",
            "opt1" : "Sequential logic",
            "opt2" : "Combinational logic",
            "opt3" : "Multiplexing",
            "answer" : "Combinational logic",
            "description":"The design of an ALU is based on combinational logic. Because the unit has a regular pattern, it can be broken into identical stages connected in cascade through carries."
        },
        {
            "q" : "Operations of computer arithmetic and logic unit are directed by",
            "opt1" : "ALU itself",
            "opt2" : "control unit",
            "opt3" : "memory unit",
            "answer" : "control unit",
            "decription" :"Operations of computer arithmetic and logic unit are directed by control unit."
        },
        {
            "q" : "A digital multiplexer is a combinational circuit that selects ___________",
            "opt1" : "One digital information from several sources and transmits the selected one",
            "opt2" : "Many digital information and convert them into one",
            "opt3" : "Many decimal outputs and accepts the selected information",
            "answer" : "One digital information from several sources and transmits the selected one",
            "description" : "A digital multiplexer is a combinational circuit that selects one digital information from several sources and transmits the selected information on a single output line depending on the status of the select lines. That is why it is also known as a data selector."
        },
        {
           "q" : "In a multiplexer, the selection of a particular input line is controlled by ___________",
            "opt1" : "Data controller",
            "opt2" : "Selected lines",
            "opt3" : "Both data controller and selected lines",
            "answer" : "Selected lines",
            "description" : "The selection of a particular input line is controlled by a set of selected lines in a multiplexer, which helps to select a particular input from several sources."
        },
        {
            "q" : "Which of the following is not a basic element within the microprocessor?",
            "opt1" : "Microcontroller",
            "opt2" : "Arithmetic logic unit (ALU)",
            "opt3" : "Control unit",
            "answer" : "Microcontroller",
            "description" : "Arithmetic logic unit (ALU),Register array are basic elements within the microprocessor among the given options"
        },
        {
            "q" : "The ALU gives the output of the operations and the output is stored in the ________",
            "opt1" : "Memory Devices",
            "opt2" : "Registers",
            "opt3" : "Flags",
            "answer" : "Registers",
            "description" : "Any output generated by the ALU gets stored in the registers. The registers are the temporary memory locations within the processor that are connected by signal paths to the CPU."
        },
        {
            "q": "ALU has collection of two operations which include ___________",
            "opt1": "Memory and Logic",
            "opt2": "Arithmetic and Logic",
            "opt3": "Memory and Arithmetic",
            "answer": "Arithmetic and Logic",
            "description" : "ALU has collection of two operations, Arithmetic and Logic."
        }
    ]
}
